
* API endpoints
** Return object
#+BEGIN_SRC code
{
  "error": true || false,
  "code": HTTP codes as number,
  "message": String or null,
  "data": Object or array
}
#+END_SRC

** /api/scoreboard/

Append to or from for different scoreboard

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/scoreboard/to/inc
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": "ok",
  "data": [
    {
      "username": "USER4",
      "name": "User4",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 16
    },
    {
      "username": "USER3",
      "name": "User3",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 13
    },
    {
      "username": "USER1",
      "name": "User1",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 12
    },
    {
      "username": "USER2",
      "name": "User2",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 12
    }
  ]
}
#+end_example

** /api/userstats/

Append username of the user you want to get more stats from

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/userstats/USER1
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": "ok",
  "data": {
    "user": {
      "username": "USER1",
      "name": "User1",
      "avatar": "https://link.to.avatar.48.burrito",
      "receivedToday": 0,
      "givenToday": 2,
      "received": 22,
      "given": 23
    },
    "given": [
      {
        "username": "USER2",
        "name": "User2",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 3,
        "scoredec": 4
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 2,
        "scoredec": 2
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 5,
        "scoredec": 7
      }
    ],
    "received": [
      {
        "username": "USER2",
        "name": "User2",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 4,
        "scoredec": 3
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 3,
        "scoredec": 4
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 5,
        "scoredec": 3
      }
    ],
    "givenToday": [
      {
        "username": "USER2",
        "name": "User2",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 0,
        "scoredec": 1
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 1,
        "scoredec": 0
      }
    ],
    "receivedToday": []
  }
}
#+end_example
** /api/userstats/today/
Append username of the user you want to get more stats from

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/userstats/today/USER1
#+END_SRC

#+RESULTS:

** /api/histogram/ PRE-ALPHA

Be able to search with filters

Should be able to take folling params
| params                 | type   | required |
|------------------------+--------+----------|
| username               | string | no       |
| startDate              | string | no       |
| endDate                | string | no       |
| type ( given / gived ) | string | no       |

#+BEGIN_SRC http :pretty
POST http://heyburrito:3333/api/histogram
Content-Type: application/json


#+END_SRC

#+RESULTS:
: {
:   "error": false,
:   "code": 200,
:   "message": null,
:   "data": null
: }
